#Tatoo-салон. Клиент имеет возможность осуществлять поиск и заказ Изображений в Каталоге, а также высталвять им оценку,
# в том числе и за качество работы. Клиент может предлагать свои изображения салону, за это может получать скидки и 
# повышение рейтинга. Администратор управляет Клиентами и контентом системы.

#Customer 
#       name
#       email
#       password
#   поиск изображений 
#   заказ изображений
#   выставление оценки изображению
#   выставление оценки за качество изображения
#   пердлагать свои изображения
#   получать скидки
#   получать повышение рейтинга

#Administrator
#       name
#       email
#       password
#   Управление Клиентами
#   Управление контентом (Изображениями)

#Picture
#       description
#       prise
#       raiting
#       quality assessment

#ImageCatalog




